In [45]:
import pandas as pd
!cat ../materialy_rozpakowane/examples/ex1.csv
examples_folder = '../materialy_rozpakowane/examples/'
ex1csv = examples_folder + 'ex1.csv'
ex1xlsx = examples_folder + 'ex1.xlsx'
ex2 = examples_folder + 'ex2.csv'
ex3csv = examples_folder + 'ex3.csv'
ex3txt = examples_folder + 'ex3.txt'
ex4 = examples_folder + 'ex4.csv'
ex5 = examples_folder + 'ex5.csv'
ex6 = examples_folder + 'ex6.csv'
ex7 = examples_folder + 'ex7.csv'

alfa,beta,gamma,delta,word
5,6,7,8,ma
1,2,3,4,ala
9,10,11,12,kota

In [46]:
df = pd.read_csv(ex1csv)
df

   alfa  beta  gamma  delta  word
0     5     6      7      8    ma
1     1     2      3      4   ala
2     9    10     11     12  kota

In [47]:
!cat $ex1csv

alfa,beta,gamma,delta,word
5,6,7,8,ma
1,2,3,4,ala
9,10,11,12,kota

In [48]:
pd.read_csv(ex2)

   5   6   7   8   ala
0  1   2   3   4   ma
1  9  10  11  12  kota

In [49]:
pd.read_csv(ex2, header=None)

   0   1   2   3     4
0  5   6   7   8   ala
1  1   2   3   4   ma
2  9  10  11  12  kota

In [50]:
pd.read_csv(ex2, names=['a','b','c','d','text'])

   a   b   c   d  text
0  5   6   7   8   ala
1  1   2   3   4   ma
2  9  10  11  12  kota

In [51]:
names = ['I', 'II', 'III', 'IV', 'word']
pd.read_csv(ex2, names=names, index_col='word')

      I  II  III  IV
word
ala   5   6    7   8
ma    1   2    3   4
kota  9  10   11  12

In [52]:
list(open(ex3csv))

['            alfa         beta         gamma\n',
 'x -0.264438 -1.026059 -0.619500\n',
 'y  0.927272  0.302904 -0.032399\n',
 'z -0.264273 -0.386314 -0.217601\n',
 'v -0.871858 -0.348382  1.100491']

In [53]:
pd.read_csv(ex3txt, sep='\s+')

       alfa      beta     gamma
x -0.264438 -1.026059 -0.619500
y  0.927272  0.302904 -0.032399
z -0.264273 -0.386314 -0.217601
v -0.871858 -0.348382  1.100491

In [54]:
!cat $ex4

# niepotrzebna pierwsza linia
alfa,beta,gamma,delta,word
# komentarz1, który trzeba pominąć w danych
# komentarz2
5,6,7,8,ala
1,2,3,4,ma
9,10,11,12,kota

In [55]:
pd.read_csv(ex4, skiprows=[0,3,2])

   alfa  beta  gamma  delta  word
0     5     6      7      8   ala
1     1     2      3      4    ma
2     9    10     11     12  kota

In [56]:
!cat $ex5

name,a,b,c,d,word
ala,1,2,3,4,NA
ola,5,6,,8,ma
tosia,?,10,11,12,kota

In [58]:
pd.read_csv(ex5, na_values={'a':['?'], 'word':['?']})

    name    a   b     c   d  word
0    ala  1.0   2   3.0   4   NaN
1    ola  5.0   6   NaN   8    ma
2  tosia  NaN  10  11.0  12  kota

In [59]:
df.to_csv(examples_folder+'written.csv', na_rep='NaN')